app/controllers/locations_controller.rb

  def index
    locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    trip = Trip.find_by_id(params[])
    location = Location.new(location_params)
    if location.save
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "locations" ("name", "lat", "lon", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "qwer"], ["lat", "12.0"], ["lon", "12.0"], ["trip_id", 11], ["created_at", "2020-08-26 15:09:46.190431"], ["updated_at", "2020-08-26 15:09:46.190431"]]

  def update
    location = location = Location.find(params[:id])
    location.update(location_params)
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "locations" SET "name" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["name", "Sugar Hills"], ["updated_at", "2020-08-25 02:55:39.303103"], ["id", 1]]

  def destroy
    location = Location.find(params[:id])
    location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 7]]