app/controllers/trips_controller.rb

  def index
    trips = Trip.all
---
SELECT "trips".* FROM "trips" ORDER BY "trips"."id" ASC

  def show
    trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    trip = Trip.new(trip_params)
    if trip.save
---
INSERT INTO "trips" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Monday"], ["description", "hmm"], ["created_at", "2020-08-22 23:17:33.212485"], ["updated_at", "2020-08-22 23:17:33.212485"]]

  def update
    trip = trip = Trip.find(params[:id])
    trip.update(trip_params)
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "trips" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "trips"."id" = $4  [["name", "M0onday"], ["description", "undefined"], ["updated_at", "2020-08-23 03:37:10.272114"], ["id", 8]]

  def destroy
    trip = Trip.find(params[:id])
    trip.destroy
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 4]]